# DirectShapeTypeOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeTypeOptions Members
DirectShapeTypeOptions Class Constructors Methods Properties See Also
---
The DirectShapeTypeOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DirectShapeTypeOptions | Constructs a new DirectShapeTypeOptions instance with default settings. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the DirectShapeTypeOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqualTo | Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same. |
| IsValid | Determines whether a DirectShapeTypeOptions is internally consistent (valid). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllowDuplicateNames | Determines whether or not duplicate DirectShapeType names are allowed. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace